LouisPauchet/open-renewable-lab/sdkconfig.defaults
# Common settings for every supported target/board variant. Target-
# specific settings (flash size, PSRAM, console) live in
# sdkconfig.defaults.<target> (ESP-IDF merges them automatically based
# on `idf.py set-target`) - see sdkconfig.defaults.esp32s3 (Walter,
# production) and sdkconfig.defaults.esp32 (generic ESP32 DevKit,
# hardware-less test rig - see board_pins.h's BOARD_VARIANT_* Kconfig
# choice).

# Default target if `idf.py set-target` is never run explicitly. The
# project's primary/production target is the Walter module (ESP32-S3);
# run `idf.py set-target esp32` for the DevKit test rig.
CONFIG_IDF_TARGET="esp32s3"

# No OTA in v1 - single factory app, larger NVS for the config blob + SPA assets in flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS / watchdog tuning - generous timeout since SDI-12 measurement
# commands can legitimately take several seconds; panic+reboot (rather
# than just log) on a genuine hang, appropriate for an unattended field
# deployment. Only the steady-timing tasks (aggregation, SD writer,
# MQTT publish) are registered with the watchdog - the SDI-12/I2C bus
# scheduler tasks have inherently variable, sensor-dependent blocking
# time and are deliberately left unregistered to avoid false trips.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_TASK_WDT_PANIC=y

# Networking
CONFIG_LWIP_SNTP_MAX_SERVERS=1
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# cJSON (via the espressif/cjson managed component - no longer bundled
# in-tree as a "json" component in this ESP-IDF version) is used by
# config_store for the NVS-backed config blob, and throughout the REST
# API/MQTT payloads. Its own Kconfig (CJSON_NESTING_LIMIT/
# CJSON_CIRCULAR_LIMIT) defaults are fine as-is.

# The ESP-IDF default (3584B) overflows during app_main()'s synchronous
# init - PSA Crypto's driver-dispatch call chain (used by config_store's
# password hashing, see hash_with_salt()) is noticeably deeper than the
# legacy mbedtls_sha256_* API it replaced, and app_main also does
# WiFi/HTTP-server/cJSON work before any of that init hands off to its
# own task. Confirmed via a real stack-overflow panic in task "main" on
# first hardware boot.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
